# Indexing, Selecting and Assigning 索引、选择和分配

In [2]:
import pandas as pd
import numpy as np

## 1. Real-World Use Case  实际应用案例
- For example:  例如：
    - You are a data scientist at Amazon. During the time of New Year, your supervisor asked you to give a discount of 50% for all the electronic items available at Amazon.
    - 假设你是一名在亚马逊工作的数据科学家。在新年期间，你的上司要求对亚马逊上所有电子商品提供 50%的折扣。

    - You will never want to go to each electronic item and assign a discount of 50% to each of them. This would be a very time-consuming task. Instead, you would want to select all the items that fall under the category ‘Electronics’ and then give all of them a discount of 50% in one go. So easy, right? This is where you will need to index, select and assign data in a DataFrame.
    - 你永远不会想要去每个电子商品那里，给每个商品分配 50%的折扣。这将是一项非常耗时的工作。相反，你想要选择所有属于“电子产品”类别的商品，然后一次性给所有商品分配 50%的折扣。是不是很简单？这就是你需要对 DataFrame 中的数据进行索引、选择和分配的地方。

## 2. Indexing 索引
- What is Indexing in Pandas?  Pandas 中的索引是什么？
    - Indexing in Pandas means selecting particular rows and columns from a DataFrame.  在 Pandas 中，索引是指从 DataFrame 中选择特定的行和列。
    - Indexing in Pandas is the same as we did for a Python List and a NumPy array.  Pandas 中的索引与我们在 Python 列表和 NumPy 数组中所做的一样。
    - There are two different methods of indexing in Pandas:  Pandas 中有两种不同的索引方法：
        - iloc - index-based selection  iloc - 基于索引的选择
        - loc - label based selection  loc - 基于标签的选择

In [5]:
exam_scores = pd.read_csv('data/exam_scores.csv')
exam_scores.head(3)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,male,group B,bachelor's degree,standard,none,74,68,67
1,female,group C,some college,standard,completed,58,68,66
2,male,group C,some college,free/reduced,none,66,65,65

### a. iloc - index-based selection  iloc - 基于索引的选择
- Index-based selection is to select data based on its numerical position in DataFrame.  基于索引的选择是指根据其在 DataFrame 中的数值位置来选择数据。
- iloc is used for selecting data based on numerical position.  iloc 用于根据数值位置选择数据。
- The syntax for using the iloc operator is  使用 iloc 操作符的语法是  df.iloc[row_index, column_index]

In [6]:
# Selecting data using iloc:  使用 iloc 选择数据：
exam_scores.iloc[0, 0]  # Selecting the first row and first column

'male'

In [7]:
# Selecting multiple rows and columns using iloc:  使用 iloc 选择多行和多列
exam_scores.iloc[0:3, 0:2]  # Selecting the first three rows and first two columns

   gender race/ethnicity
0    male        group B
1  female        group C
2    male        group C

In [8]:
exam_scores.iloc[:,:] # Selecting all rows and all columns

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,male,group B,bachelor's degree,standard,none,74,68,67
1,female,group C,some college,standard,completed,58,68,66
2,male,group C,some college,free/reduced,none,66,65,65
3,female,group D,bachelor's degree,free/reduced,none,74,75,73
4,male,group D,some college,standard,none,78,77,71
...,...,...,...,...,...,...,...,...
995,female,group C,some high school,standard,none,68,77,72
996,female,group E,some college,standard,none,98,81,94
997,female,group E,associate's degree,free/reduced,none,67,67,67
998,female,group C,high school,standard,none,63,68,70
999,male,group C,some college,free/reduced,none,49,57,50

In [9]:
# You can also pass list of indexes  你也可以传递索引列表
exam_scores.iloc[[0, 1, 2], [0, 1]]  # Selecting first three rows and first two columns

   gender race/ethnicity
0    male        group B
1  female        group C
2    male        group C

In [10]:
# You can also pass negative indexes  你也可以传递负索引
exam_scores.iloc[-3:, -2:]  # Selecting last three rows and last two columns

     reading score  writing score
997             67             67
998             68             70
999             57             50

### b. Label-Based Selection  基于标签的选择
- Label-based selection selects data based on the column or row names/index. This becomes important while selecting data from a DataFrame.  基于标签的选择是根据列名或行名/索引来选择数据。在从 DataFrame 中选择数据时，这一点变得很重要。
- Label-based selection is made with loc.  基于标签的选择是通过 loc 实现的。
- The syntax for using the loc operator is  使用 loc 操作符的语法是  df.loc[row_label, column_label]

In [11]:
# Selecting data using loc:  使用 loc 选择数据：
exam_scores.loc[0, 'race/ethnicity']

'group B'

In [12]:
exam_scores.loc[0:5, ['gender', 'lunch', 'math score']]

   gender         lunch  math score
0    male      standard          74
1  female      standard          58
2    male  free/reduced          66
3  female  free/reduced          74
4    male      standard          78
5  female      standard          75

## 3. Selecting 选择

### a. Attribute (Dot) Based Selection  基于属性（点）的选择

In [13]:
exam_scores.gender

0        male
1      female
2        male
3      female
4        male
        ...
995    female
996    female
997    female
998    female
999      male
Name: gender, Length: 1000, dtype: object

### b. Dictionary (Bracket) Based Selection  基于字典（括号）的选择

In [14]:
exam_scores['lunch']

0          standard
1          standard
2      free/reduced
3      free/reduced
4          standard
           ...
995        standard
996        standard
997    free/reduced
998        standard
999    free/reduced
Name: lunch, Length: 1000, dtype: object

### c. Selecting Multiple Columns  选择多个列

In [15]:
exam_scores[['lunch', 'math score']]

            lunch  math score
0        standard          74
1        standard          58
2    free/reduced          66
3    free/reduced          74
4        standard          78
..            ...         ...
995      standard          68
996      standard          98
997  free/reduced          67
998      standard          63
999  free/reduced          49

[1000 rows x 2 columns]

### d. Conditional Selection  条件选择

In [51]:
exam_scores.rename(columns={
    'math score': 'math_score',
    'reading score': 'reading_score',
    'writing score': 'writing_score',
    'math score': 'math_score',
    'test preparation course': 'test_preparation',
    'parental level of education': 'parental_level_of_education'
}, inplace=True)  # Renaming column for easier access

# Selecting rows based on a condition, returning true or false values
exam_scores.math_score > 70  # Selecting rows where math score is greater than 70

0       True
1      False
2      False
3       True
4       True
       ...
995    False
996     True
997    False
998    False
999    False
Name: math_score, Length: 1000, dtype: bool

In [52]:
# Selecting rows based on a condition,returning the whole DataFrame where the condition is true
exam_scores[exam_scores.math_score > 70]

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation,math_score,reading_score,writing_score
0,assing_value test,group B,bachelor's degree,standard,none,74,68,67
3,assing_value test,group D,bachelor's degree,free/reduced,none,74,75,73
4,assing_value test,group D,some college,standard,none,78,77,71
5,assing_value test,group D,associate's degree,standard,completed,75,82,85
9,assing_value test,group B,master's degree,standard,none,87,75,79
...,...,...,...,...,...,...,...,...
989,assing_value test,group A,some college,standard,none,74,65,67
991,assing_value test,group B,master's degree,standard,completed,78,76,80
992,assing_value test,group A,bachelor's degree,standard,none,78,73,71
994,assing_value test,group C,master's degree,standard,completed,85,93,90
996,assing_value test,group E,some college,standard,none,98,81,94

## 4. Assigning Values 分配值
- Assigning values in a DataFrame is done using the assignment operator (=).  在 DataFrame 中分配值是使用赋值运算符（=）完成的。

In [53]:
exam_scores.gender = 'assing_value test'
exam_scores

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation,math_score,reading_score,writing_score
0,assing_value test,group B,bachelor's degree,standard,none,74,68,67
1,assing_value test,group C,some college,standard,completed,58,68,66
2,assing_value test,group C,some college,free/reduced,none,66,65,65
3,assing_value test,group D,bachelor's degree,free/reduced,none,74,75,73
4,assing_value test,group D,some college,standard,none,78,77,71
...,...,...,...,...,...,...,...,...
995,assing_value test,group C,some high school,standard,none,68,77,72
996,assing_value test,group E,some college,standard,none,98,81,94
997,assing_value test,group E,associate's degree,free/reduced,none,67,67,67
998,assing_value test,group C,high school,standard,none,63,68,70
999,assing_value test,group C,some college,free/reduced,none,49,57,50

## 5. Exercise 练习

In [23]:
sma_data = pd.read_csv('data/Standard_Metropolitan_Areas_Data-data.csv')

In [54]:
sma_data.head(3)

,land_area,percent_city,percent_senior,physicians,hospital_beds,graduates,work_force,income,region,crime_rate
0,1384,78.1,12.3,25627,69678,50.1,4083.9,72100,1,75.55
1,3719,43.9,9.4,13326,43292,53.9,3305.9,54542,2,56.03
2,3553,37.4,10.7,9724,33731,50.6,2066.3,33216,1,41.32

In [29]:
sma_data.iloc[9:10, ]

,land_area,percent_city,percent_senior,physicians,hospital_beds,graduates,work_force,income,region,crime_rate
9,4647,31.5,9.2,3916,12815,65.1,1032.2,14542,2,55.3

In [50]:
sma_data['physicians'].iloc[-1]

np.int64(140)

In [64]:
sample_data1 = sma_data.loc[[1, 3, 5, 7, 9, 13], ['land_area', 'work_force', 'income', 'region', 'crime_rate']]
sample_data1

    land_area  work_force  income  region  crime_rate
1        3719      3305.9   54542       2       56.03
3        3916      1966.7   32906       2       67.38
5        2815      1541.9   25663       3       58.48
7        6794      1272.7   18221       3       64.88
9        4647      1032.2   14542       2       55.30
13        782       915.2   12591       4       63.20

In [71]:
sample_data2 = sma_data[sma_data.region == 2]
sample_data2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 25 entries, 1 to 92
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   land_area       25 non-null     int64
 1   percent_city    25 non-null     float64
 2   percent_senior  25 non-null     float64
 3   physicians      25 non-null     int64
 4   hospital_beds   25 non-null     int64
 5   graduates       25 non-null     float64
 6   work_force      25 non-null     float64
 7   income          25 non-null     int64
 8   region          25 non-null     int64
 9   crime_rate      25 non-null     float64
dtypes: float64(5), int64(5)
memory usage: 2.1 KB